import { Link } from "react-router-dom";
import { FaArrowLeft } from 'react-icons/fa';

function Privacy(){


    return(
        <div className="bg-gray-100">
  <div className="container px-4 py-8 mx-auto text-end">
  <Link to="/CheckOutCandidate" className="flex items-center mb-4 text-green-950 hover:underline">
          <FaArrowLeft className="mr-2" />
          العودة إلى الصفحة السابقة
        </Link>
    <h1 className="mb-4 text-3xl font-bold">
      سياسة الخصوصية
    </h1>
    <p className="mb-4">
      توضح سياسة الخصوصية هذه كيف يستخدم موقعنا ويحمى أية معلومات تقدمها لنا عند استخدامك لهذا الموقع.
    </p>
    <h2 className="mb-2 text-2xl font-bold">
      المعلومات التي نقوم بجمعها
    </h2>
    <p className="mb-4">
      قد نقوم بجمع المعلومات التالية:
    </p>
    <ul className="mb-4 list-disc list-inside">
      <li>
        اسمك ومعلومات الاتصال الخاصة بك
      </li>
      <li>
        معلومات ديموغرافية
      </li>
      <li>
        معلومات أخرى تتعلق بالاستطلاعات والعروض
      </li>
    </ul>
    <h2 className="mb-2 text-2xl font-bold">
      كيف نستخدم المعلومات
    </h2>
    <p className="mb-4">
      نحن بحاجة إلى هذه المعلومات لفهم احتياجاتك وتقديم خدمة أفضل لك، ولأغراض محددة، مثل:
    </p>
    <ul className="mb-4 list-disc list-inside">
      <li>
        الحفاظ على السجلات الداخلية
      </li>
      <li>
        تحسين منتجاتنا وخدماتنا
      </li>
      <li>
        إرسال رسائل بريد إلكتروني ترويجية حول منتجات جديدة، عروض خاصة، أو معلومات أخرى قد تجدها مثيرة للاهتمام
      </li>
      <li>
        من وقت لآخر، قد نستخدم معلوماتك أيضًا للاتصال بك لأغراض البحث التسويقي. قد نتصل بك عبر البريد الإلكتروني أو الهاتف أو البريد. قد نستخدم المعلومات لتخصيص الموقع وفقًا لاهتماماتك.
      </li>
    </ul>
    <h2 className="mb-2 text-2xl font-bold">
      الأمان
    </h2>
    <p className="mb-4">
      نحن ملتزمون بضمان أن تكون معلوماتك آمنة. لمنع الوصول غير المصرح به أو الكشف عنها، قمنا بوضع إجراءات مادية وإلكترونية وإدارية مناسبة لحماية وتأمين المعلومات التي نجمعها عبر الإنترنت.
    </p>
    <h2 className="mb-2 text-2xl font-bold">
      الكوكيز
    </h2>
    <p className="mb-4">
      الكوكيز هي ملف صغير يطلب إذنًا لوضعه على القرص الصلب لجهاز الكمبيوتر الخاص بك. بمجرد الموافقة، يتم إضافة الملف، ويساعد الكوكيز على تحليل حركة المرور على الويب أو يتيح لك معرفة متى تزور موقعًا معينًا. تسمح الكوكيز لتطبيقات الويب بالاستجابة لك كفرد. يمكن لتطبيق الويب تخصيص عملياته وفقًا لاحتياجاتك، وتفضيلاتك من خلال جمع وتذكر المعلومات عن تفضيلاتك.
    </p>
    <p className="mb-4">
      بشكل عام، تساعدنا الكوكيز في توفير موقع ويب أفضل لك من خلال تمكيننا من مراقبة الصفحات التي تجدها مفيدة والتي لا تجدها كذلك. الكوكيز لا تمنحنا أي وصول إلى جهاز الكمبيوتر الخاص بك أو أي معلومات عنك، سوى البيانات التي تختار مشاركتها معنا.
    </p>
    <h2 className="mb-2 text-2xl font-bold">
      الروابط إلى مواقع أخرى
    </h2>
    <p className="mb-4">
      قد يحتوي موقعنا على روابط لمواقع أخرى ذات اهتمام. ومع ذلك، بمجرد استخدامك لتلك الروابط لمغادرة موقعنا، يجب أن تلاحظ أننا لا نملك أي تحكم على ذلك الموقع الآخر. لذلك، لا يمكننا أن نكون مسؤولين عن حماية وخصوصية أي معلومات تقدمها أثناء زيارة هذه المواقع، وهذه المواقع ليست خاضعة لهذه السياسة الخصوصية. يجب عليك توخي الحذر والنظر في بيان الخصوصية الخاص بالموقع المعني.
    </p>
    <h2 className="mb-2 text-2xl font-bold">
      التحكم في معلوماتك الشخصية
    </h2>
    <p className="mb-4">
      يمكنك اختيار تقييد جمع أو استخدام معلوماتك الشخصية بالطرق التالية:
    </p>
    <ul className="mb-4 list-disc list-inside">
      <li>
        إذا كنت قد وافقت سابقًا على استخدام معلوماتك الشخصية لأغراض التسويق المباشر، يمكنك تغيير رأيك في أي وقت عن طريق الكتابة إلينا أو إرسال بريد إلكتروني إلى [البريد الإلكتروني المحمي]
      </li>
      <li>
        لن نقوم ببيع أو توزيع أو تأجير معلوماتك الشخصية إلى أطراف ثالثة ما لم نحصل على إذنك أو نكون ملزمين بذلك قانونيًا. قد نستخدم معلوماتك الشخصية لإرسال معلومات ترويجية عن أطراف ثالثة التي نعتقد أنها قد تكون مثيرة للاهتمام إذا أخبرتنا أنك ترغب في حدوث ذلك.
      </li>
      <li>
        يمكنك طلب تفاصيل المعلومات الشخصية التي نحتفظ بها عنك. إذا كنت ترغب في الحصول على نسخة من المعلومات التي نحتفظ بها عنك، يرجى الكتابة إلى [اسم الشركة، العنوان، المدينة، الولاية، الرمز البريدي] أو إرسال بريد إلكتروني إلى [البريد الإلكتروني المحمي]
      </li>
      <li>
        إذا كنت تعتقد أن أي معلومات نحتفظ بها عنك غير صحيحة أو غير كاملة، يرجى الكتابة إلينا أو إرسال بريد إلكتروني إلينا في أقرب وقت ممكن على العنوان أعلاه. سنقوم بتصحيح أي معلومات نجدها غير صحيحة على الفور.
      </li>
    </ul>
    <p className="mb-4">
      سياسة الخصوصية هذه عرضة للتغيير دون إشعار مسبق.
    </p>
  </div>
</div>

    )
}
export default Privacy;